<template>
  <div style="text-align: start">
    <link href="/static/CSSfiles/MarkDown.css" rel="stylesheet">
    <div class='typora-export os-windows'>
      <div class='typora-export-content'>
        <div id='write' class=''><h1 id='网易游戏客户端日常实习二面面经-面试官太好玩了跟面试官聊嗨了-乐'><span>网易游戏客户端日常实习二面面经 面试官太好玩了，跟面试官聊嗨了 乐</span>
        </h1>
          <h2 id='面试形式'><span>面试形式：</span></h2>
          <p><span>用网易招聘官网自带的面试系统 没有现场写代码的笔试 只问问题。</span></p>
          <p><span>这次面我的是一个看起来很年轻的小哥，感觉很好聊天的样子，很有意思哈哈哈。</span></p>
          <h2 id='面试流程'><span>面试流程：</span></h2>
          <ol start=''>
            <li><span>自我介绍</span></li>
            <li><span>依据简历内容从上往下问项目经历、学习经历</span></li>
            <li><span>问基础八股</span></li>
            <li><span>你有什么问题想问面试官的吗？</span></li>
          </ol>
          <h2 id='自我介绍'><span>自我介绍</span></h2>
          <p>
            <span>谈到我大学期间在一个做游戏开发的团队（西南石油大学灵创新媒实验室）学游戏开发的时候，面试官问了下我们团队的规模，</span>
          </p>
          <p><span>然后我介绍了一遍。</span></p>
          <h2 id='项目经历'><span>项目经历</span></h2>
          <p>
            <span>这个面试官很有意思，没有一上来就问我八股，就问我的两个项目，我就重点介绍了我的前两个项目。并且详细讲解了这些项目用到的设计模式等等，讲了很多。</span>
          </p>
          <p><span>也深度问看了我的项目里面的AI是怎么写的，具体的AI的逻辑等等，都答得上来。</span></p>
          <p><span>这次面试主要是项目经历和图形学问我问得比较多，这些东西，我不想赘述了，想省流直接看闲聊环节吧。</span></p>
          <h2 id='学习经历'><span>学习经历</span></h2>
          <p>
            <span>面试官看我学过GAMES104和GAMS101逮着我问图形学和游戏引擎底层，还好啦，虽然都是一年前学的了，但还是基本上都答得上来，但是我做不到非常精通的感觉，讲得比较浅。这问题也在后面被面试官指出了。</span>
          </p>
          <h2 id='问八股题'><span>问八股题</span></h2>
          <p><span>就问了下智能指针，主要还是图形学、项目经历问的多。</span></p>
          <h2 id='闲聊环节'><span>闲聊环节</span></h2>
          <p>
            <span>其实是面试最后的常规环节啦，就是面试官说:&quot;你有什么问题想问我的吗?&quot;但是聊嗨了，变成了闲聊，我和面试官聊了很久，内容如下：</span>
          </p>
          <p>
            <span>我：“您觉得我这次面试里面,j有哪些回答得不好的地方，哪些系统回答错误了？我现在大二，还有一年的时间，可以再学。”</span>
          </p>
          <p><span>面试官：”这么卷的吗？你大二？“</span></p>
          <p><span>我：”我的毕业时间系统里面应该是有的吧“</span></p>
          <p><span>面试官：”我只看到你的年龄是20岁，刚开始也感觉像是大二的年龄，结果真的是。“</span></p>
          <p><span>我：“其实这段时间已经面了好几家公司了，大厂小厂都有吧。”</span></p>
          <p>
            <span>然后，我给面试官闲聊讲了下我自己这段时间面试、笔试的情况，总之就是大厂要和24届的抢，难卷进，小厂呢又要那种能长期实习转正的，不会养25届的，那我大二面这个会不会有问题吗？</span>
          </p>
          <p><span>面试官（笑）：”哈哈哈，不会不会的，网易养得起！哈哈哈“</span></p>
          <p><span>面试官问我说你大二哪里来的那么多学GAMES101 GAMES104还有这么多内容的？</span></p>
          <p><span>我就说大一的时候边刷Leetcode边看GAMES系列课程，反正就是没闲过，一直卷到今天。</span></p>
          <p><span>面试官说他当年大四毕业就学到像我这样程度就进网易了（笑），他大学的时候也是在游戏开发的社团里面混，也打了很多游戏开发比赛，但是现在他面了很多人，都是24届，说我的情况在25届里面算是很优秀了，但是现在已经卷到人均GAMES101,GAMES104了。然后这个岗还有很多24届的再面，相比之下，25届就比较难进了。</span>
          </p>
          <p><span>我（笑）：”确实，现在就是这样，已经卷麻了。“</span></p>
          <p><span>面试官：”哈哈哈，是的。其实吧你现在的情况应该是没什么问题了，只是你还需要精通引擎里面的任意一个模块，完全熟悉其底层。因为大厂其实并不需要什么都会的人，而是要精通一个方向就行了，学的多，但是不够精是不行的，各个模块会有不同的人做。“</span>
          </p>
          <p><span>我（笑）：”确实，那么我觉得接下来我应该深入学习引擎的一个模块底层。“</span></p>
          <p>
            <span>然后后面，闲聊了很多包括网易他们对日常实习生的定位什么的问题、图形程序本科还有没有可能卷进去的问题（答案是本科生还是老老实实干客户端吧）。</span>
          </p>
          <p>
            <strong><span>然后又了很多很多别的话题，本来四五十分钟就该结束的面试，聊到了一个多小时hhh，这些就比较无关紧要了，哈哈哈，聊得很轻松很开心哈哈哈。</span></strong>
          </p>
          <p>
            <strong><span>最后我感谢了这位可爱的面试官小哥哥，很有耐心给我一个大二的讲了这么多知识哈哈哈!</span></strong>
          </p>
          <h2 id='总结'><span>总结</span></h2>
          <p>
            <span>这次面试虽然很愉悦，但我觉得应该是拿不到offer的了，用面试官的话来说就是，他这几天面这个岗，都是大四的。说白了就是24届的都轮不上，更不要说我这个25届的了。</span>
          </p>
          <p><span>不过学到面经就已经足够了。感谢这位面试官，太爱了，明年再试！</span></p></div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'NetEaseFaceExperience1'
}
</script>

<style scoped>

</style>
